results/runs/ycsb/2026-05-17T10-16-32/mongodb/load_workload_d.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
Command line: -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-17 10:14:52:900 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 10:15:02:852 10 sec: 88394 operations; 8837.63 current ops/sec; est completion in 2 second [INSERT: Count=88424, Max=462079, Min=246, Avg=1041.83, 90=1803, 99=8783, 99.9=20223, 99.99=225279] 
2026-05-17 10:15:04:417 11 sec: 100000 operations; 7411.24 current ops/sec; [CLEANUP: Count=10, Max=15127, Min=2, Avg=1517, 90=17, 99=15127, 99.9=15127, 99.99=15127] [INSERT: Count=11576, Max=47039, Min=268, Avg=1234.54, 90=2529, 99=11127, 99.9=20943, 99.99=31967] 
[OVERALL], RunTime(ms), 11568
[OVERALL], Throughput(ops/sec), 8644.536652835408
[TOTAL_GCS_G1_Young_Generation], Count, 19
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 187
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.6165283540802216
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 19
[TOTAL_GC_TIME], Time(ms), 187
[TOTAL_GC_TIME_%], Time(%), 1.6165283540802216
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 1517.0
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 15127
[CLEANUP], 95thPercentileLatency(us), 15127
[CLEANUP], 99thPercentileLatency(us), 15127
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 1064.13871
[INSERT], MinLatency(us), 246
[INSERT], MaxLatency(us), 462079
[INSERT], 95thPercentileLatency(us), 3247
[INSERT], 99thPercentileLatency(us), 9207
[INSERT], Return=OK, 100000